In [ ]:
#ch2 Pandas

In [ ]:
# pandas is an open source library built on top of numpy
# it allows for fast analysis and data cleaning and preparation
# it excels in performance and productivity
# it also has built-in visualization features
# it can work with data from a wide variety of sources

# pip install pandas

In [ ]:
# Series
# DataFrames
# Missing Data
# GroupBy
# Merging,Joining,and Concatinating
# Operations
# Data Input and Output

In [4]:
# Series is simular to a numpy array
# Series can have axis labels - it can be indexed by a label

import numpy as np
import pandas as pd

#4 seperate python objects

#list of letters
labels = ['a','b','c']

#list of ints
my_data = [10,20,30]

#numpy array
arr = np.array(my_data)

#dictionary
d={'a':10,'b':20,'c':30}

#how to create series
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)
# numpy array will work the same as a normal list in python

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)
#will automatically set the keys as the index and then the key pair value as the datapoint

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])
#can pass in references to built in function as the datapoint

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
series1 = pd.Series([1,2,3,4],['USA','Germany','Russia','Japan'])
series1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [13]:
series2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])
series2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [14]:
series1['Russia']

3

In [16]:
series2[2]

3

In [17]:
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

In [ ]:
#where it cannot find a match, it places a NaN

In [24]:
# DataFrames

import numpy as np
import pandas as pd

from numpy.random import randn
np.random.seed(101)

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#DataFrames a bunch of Series that share an index

In [25]:
df['W'] # W column is a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
type(df['W'])

pandas.core.series.Series

In [27]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df.W
# be careful that if you are using this way that it does not match the name of an actual method,
# methods could get overwriten by a column name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
#better way is to use brackets
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
#creating a new column
df['new'] = df['W'] + df['Y']
df
#(new has all the values added up from row W adding to Y)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [36]:
#for removing columns you can use .drop
df.drop('new',axis=1)
#drop doesn't happen in place

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
df.drop('new',axis=1,inplace=True)
#pandas does this so that you do not accidentally lose data
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
#drop can also get rid of rows

df.drop('E')
#again not doing this in place

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [40]:
df.shape

(5, 4)

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# (rows,columns)
# rows are refered to as the 0 axis
# columns are refered to as the 1 axis

In [45]:
#selecting Columns
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [46]:
#selecting Rows .LOC
#   location[label row]
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [ ]:
# not only are the columns series but the rows are series as well as far as the way they're going to get 
# returned when you request them in Pandas

In [49]:
#the second way to grab a row is based off of index location .ILOC
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [50]:
# can specify which row and column to index
        #row B column Y
df.loc['B','Y']

-0.8480769834036315

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
#what if you wanted the a b rows with they w y columns
df.loc[['A','B'] , ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [53]:
#conditional selection using bracket notation
df > 0
# returns true if that value is greater than zero

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [54]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [55]:
df[booldf]
#values to where value was true, NaN to where they were false

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
#normally you wouldn't seperate these steps and assign a var you'd just make it one line
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [60]:
df[df['W']>0]
#will only recieve the rows to where the value is > 0
#it skipped over the C row because it was a negative value

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
#grab all the rows in dataframe where z is less than 0
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [64]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [66]:
#this can all be done in one step
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
# indexing the datafield --> indexing column W --> return value if it is > 0 --> index the next column over and return all of those values
df[df['W']>0]['X']

In [71]:
boolseries = df['W']>0
result = df[boolseries]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [74]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [77]:
#multiple conditions - 2 or more conditions

df[(df['W']>0) and (df['Y']>1)]
#The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all()
# pythons normal and operator can't actually take into account a series of boolean values compared to another series of boolean
# can only take in single booleans at a time

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [78]:
True and False

False

In [79]:
True and True

True

In [80]:
boolseries = df['W']>0
boolseries

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [81]:
# and operator gets confused at all the different boolean values, can only deal with single instances of values
#when you're working with pandas and want multiple conditions you have to use the & sign

df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [82]:
#if you want to do an OR operation use pipe |
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [83]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
#how to rest index back to default (range index 0,1,2,3,4--)
df.reset_index()

# original index is set to a column 
# this does not occur in place - needs inplace = True if you wanted that or variable assignment

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [86]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [87]:
df['States']=newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [91]:
#if you have a column in your dataset that you want to be the index use
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509